#Если ТонкийКлиент Тогда

#Область ПрограммныйИнтерфейс

// Получает описание товара из Mistral
//
// Параметры:
//  НазваниеТовара - Строка - название товара, для которого нужно получить описание
//
// Возвращаемое значение:
//  Строка - описание товара
Асинх Функция ПолучитьОписаниеТовара(НазваниеТовара) Экспорт

	Если Не ЗначениеЗаполнено(НазваниеТовара) Тогда
		Возврат "";
	КонецЕсли;
	
	Ключ = ОбщегоНазначенияМПВызовСервера.ПолучитьЗначениеКонстанты("MistralAPIКлюч");
	
	Если НЕ ЗначениеЗаполнено(Ключ)  Тогда
		ПоказатьПредупреждение(, "Не заполнен API ключ доступа к ИИ");
		Возврат "";
	КонецЕсли;
	 
	ТелоЗапросаJSON = СформироватьТелоЗапроса(НазваниеТовара);
	
	Если ЗначениеЗаполнено(ТелоЗапросаJSON) Тогда
		Запрос = Новый HTTPЗапрос();
		Запрос.АдресРесурса = "/v1/responses";
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.Заголовки.Вставить("Authorization", СтрШаблон("Api-Key %1", Ключ));
		Запрос.Заголовки.Вставить("OpenAI-Project", "b1guegbsiolnil4s2uoa");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON);
		Соединение = Новый HTTPСоединение("ai.api.cloud.yandex.net", 443, , , , 30, Новый ЗащищенноеСоединениеOpenSSL());
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
			ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON);
			Если ДанныеОтвета.Свойство("output") И ДанныеОтвета.output.Количество() > 0 Тогда
				Возврат ДанныеОтвета.output[0].content[0].text;
			Иначе
				ПоказатьПредупреждение(, "Не удалось корректно сформировать запрос к серверу", ,"Ошибка");
			КонецЕсли; 
		Иначе
			ПоказатьПредупреждение(, Ответ.ПолучитьТелоКакСтроку(), ,"Ошибка");
			Возврат "";
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Не удалось сформировать запрос к сервису", );
		Возврат "";
	КонецЕсли;
 
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Асинх Функция ВыполнитьЗапросКMistral(ТелоJSON, APIКлюч)


	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Формирование JSON запроса
////////////////////////////////////////////////////////////////////////////////

Функция СформироватьТелоЗапроса(НазваниеТовара)

	Инструкция = СтрШаблон("Ты маркетолог компании по продаже автомобильных изделий. Всегда отвечай на русском языке");
	Вхождение = СтрШаблон("Дай торговое описание товара: %1", НазваниеТовара);
	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("model","gpt://b1guegbsiolnil4s2uoa/aliceai-llm/latest");
	ОписаниеЗапроса.Вставить("instructions", Инструкция);
	ОписаниеЗапроса.Вставить("input", Вхождение);
	ОписаниеЗапроса.Вставить("temperature",0.3);
	ОписаниеЗапроса.Вставить("max_output_tokens",500);
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, ОписаниеЗапроса);
	
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли