#Область ПрограммныйИнтерфейс

// Получает описание товара из Mistral
//
// Параметры:
//  НазваниеТовара - Строка - название товара, для которого нужно получить описание
//
// Возвращаемое значение:
//  Строка - описание товара
Асинх Функция ПолучитьОписаниеТовара(НазваниеТовара) Экспорт


КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Асинх Функция ВыполнитьЗапросКMistral(ТелоJSON, APIКлюч)

	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Формирование JSON запроса
////////////////////////////////////////////////////////////////////////////////

Функция СформироватьТелоЗапроса(НазваниеТовара)

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Hello");
	Сообщение.Сообщить();
		
КонецФункции

#КонецОбласти